---
type: AdvancedLayered
namespace: Autodesk.Revit.DB.Visual
version: 2024
members: 16
tags: [revit-api, class]
---

# AdvancedLayered

`Autodesk.Revit.DB.Visual.AdvancedLayered` · Revit 2024 · 16 members

| Kind | Member | Since | Signature |
| --- | --- | --- | --- |
| Property | LayeredAnisotropy | 2018.1 | `public static string LayeredAnisotropy { get ; }` |
| Property | LayeredBottomF0 | 2018.1 | `public static string LayeredBottomF0 { get ; }` |
| Property | LayeredDiffuse | 2018.1 | `public static string LayeredDiffuse { get ; }` |
| Property | LayeredF0 | 2018.1 | `public static string LayeredF0 { get ; }` |
| Property | LayeredFraction | 2018.1 | `public static string LayeredFraction { get ; }` |
| Property | LayeredNdfType | 2018.1 | `public static string LayeredNdfType { get ; }` |
| Property | LayeredNormal | 2018.1 | `public static string LayeredNormal { get ; }` |
| Property | LayeredRotation | 2018.1 | `public static string LayeredRotation { get ; }` |
| Property | LayeredRoughness | 2018.1 | `public static string LayeredRoughness { get ; }` |
| Property | SurfaceAlbedo | 2018.1 | `public static string SurfaceAlbedo { get ; }` |
| Property | SurfaceAnisotropy | 2018.1 | `public static string SurfaceAnisotropy { get ; }` |
| Property | SurfaceCutout | 2018.1 | `public static string SurfaceCutout { get ; }` |
| Property | SurfaceNdfType | 2018.1 | `public static string SurfaceNdfType { get ; }` |
| Property | SurfaceNormal | 2018.1 | `public static string SurfaceNormal { get ; }` |
| Property | SurfaceRotation | 2018.1 | `public static string SurfaceRotation { get ; }` |
| Property | SurfaceRoughness | 2018.1 | `public static string SurfaceRoughness { get ; }` |